Repository: MEsterel/MCrypt
Catalog: MCrypt/Resources/lang.*.resx
Languages: fr

# AboutMessage
source: Easily encrypt files and folders with a high secured AES encryption system well integrated in Windows Explorer. - LICENSE - This application is a creation of Matthieu Badoy, who owns the author rights. Pleasy do NOT modify this application. You are allowed to share this application, by putting a link to this license. Thanks to Metro UI for the spinning loader. -----------
fr: Cryptez facilement des fichiers et des dossiers avec le système de cryptage de haute sécurité AES bien intégré à Windows Explorer. - LICENCE - Cette application est une création de Matthieu Badoy, qui détient les droits d'auteur. Merci de ne PAS modifier cette application. Vous êtes autorisé à partager cette application, en mettant un lien vers cette licence. Merci à Metro UI pour le symbole de chargement tournant. -----------

source: A file named
fr: Un fichier nommé

source: All Files
fr: Tous les fichiers

# alreadyExistsReplaceIt
source: already exists. Do you want to replace it?
fr: existe déjà. Voulez-vous le remplacer ?

# AnErrorOccuredDuringDecryption
source: An error occured during file decryption.
fr: Une erreur est survenue pendant le décryptage du fichier.

# AnErrorOccuredDuringEncryption
source: An error occured during file encryption.
fr: Une erreur est survenue pendant le cryptage du fichier.

source: Author:
fr: Auteur :

# ChooseFileToOpen
source: Choose a file to open
fr: Choisissez un fichier à ouvrir

# ChooseFolderToEncrypt
source: Choose a folder to encrypt
fr: Choisissez un dossier à crypter

source: Choose save location
fr: Choisissez un emplacement de sauvegarde

source: Decrypt
fr: Décrypter

source: Decrypting
fr: Décryptage

source: Details:
fr: Détails :

source: Encrypting back the
fr: Rechiffrement du

source: Encrypting the
fr: Cryptage du

source: Error
fr: Erreur

source: file
fr: fichier

source: Finalizing
fr: Finalisation

source: folder
fr: dossier

# ImpossibleToDecryptDirectory
source: It is impossible to decrypt a directory.
fr: Il est impossible de décrypter un dossier.

# MCryptHardWorkingPrompt
source: MCrypt is hard working: exiting the application could result in a loss of data. Do you REALLY want to exit?
fr: MCrypt travaille dur : quitter l'application pourrait résulter en une perte de données. Voulez-vous VRAIMENT quitter ?

source: Opening
fr: Ouverture en cours

# OriginalFileMovedBeforeDecryption
source: Original file has been moved or deleted before decryption.
fr: Le fichier original a été déplacé ou supprimé avant le décryptage.

# OriginalObjectToEnryptMoved
source: Original object to encrypt has been moved or deleted before encryption.
fr: L'objet à crypter a été déplacé ou supprimé avant le cryptage.

# PasswordsDoNotMatch
source: Entered passwords do not match.
fr: Les mots de passe fournis ne correspondent pas.

# PleaseConfirmPassword
source: Please confirm the password.
fr: Veuillez confirmer le mot de passe.

source: Please enter a password.
fr: Veuillez entrer un mot de passe.

source: Please enter your password.
fr: Veuillez entrer votre mot de passe.

# PleaseOnlyDropOneFile
source: Please drop only one file.
fr: Il n'est possible de déposer qu'un seul fichier à la fois.

# PleaseSelectFile
source: Please select a file to open.
fr: Veuillez sélectionner un fichier à ouvrir.

# PleaseSpecifyOutputLocation
source: Please specify the location of the output file.
fr: Veuillez préciser l'emplacement du fichier de sortie.

source: Preparing
fr: Préparation

# SpecifiedDirectoryDoesntExist
source: The specified directory does not exist.
fr: Le répertoire précisé n'existe pas.

# SpecifiedObjectNotFound
source: The specified object does not exists.
fr: L'objet précisé n'existe pas.

# TheFileToDecryptIsNotMCryptFile
source: The file to decrypt is not a MCrypt encrypted file.
fr: Le fichier à décrypter n'est pas un fichier crypté MCrypt.

source: Waiting for the file to exit
fr: En attente de la fermeture du fichier

source: Warning
fr: Attention

# WrongPassword
source: Wrong password. (Note: a lost password is unrecoverable)
fr: Mot de passe incorrect. (Note : un mot de passe perdu est irrécupérable)
